{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a03c1e9c-42c8-4fea-aec8-d26b8743d653')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a03c1e9c-42c8-4fea-aec8-d26b8743d653')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2023-02-01-preview",
      "properties": {
        "displayName": "Possible LSASS memory access via lsadump or similar tool (via audit)",
        "description": "Detects attempts to access LSASS process via mimikatz lsadump. Technique: T1003.",
        "alertDetailsOverride": null,
        "customDetails": null,
        "entityMappings": null,
        "eventGroupingSettings": null,
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": false,
            "groupByAlertDetails": null,
            "groupByCustomDetails": null,
            "groupByEntities": [],
            "lookbackDuration": "PT5M",
            "matchingMethod": "AllEntities",
            "reopenClosedIncident": false
          }
        },
        "query": "SecurityEvent | where (EventID == \"4656\" and (ObjectType == \"SAM_DOMAIN\") and (ProcessName == \"lsass.exe\") and (AccessMask == \"0x705\"))",
        "queryPeriod": "PT12H",
        "queryFrequency": "PT12H",
        "sentinelEntitiesMappings": null,
        "severity": "High",
        "suppressionDuration": "PT12H",
        "suppressionEnabled": false,
        "tactics": [
          "CredentialAccess"
        ],
        "techniques": null,
        "templateVersion": null,
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 1,
        "alertRuleTemplateName": null,
        "enabled": true
      }
    }
  ]
}